#+TITLE: Very Fun to Configure Emacs Manual and Configuration
#+AUTHOR: Ryan King
#+EMAIL: ryantking@protonmail.com
#+MACRO: export-date (eval (format-time-string "%F %R %z" (current-time)))
#+MACRO: count-words (eval (count-words (point-min) (point-max)))

+ Created :: 2022-05-27
+ Updated :: *{{{export-date}}}*
+ Word count :: *{{{count-words}}}*

#+TOC: headlines 8

** Emacs build information
#+begin_src emacs-lisp :tangle no :exports both
  (emacs-version)
#+end_src

#+RESULTS:
: GNU Emacs 28.1 (build 1, x86_64-apple-darwin21.4.0, Carbon Version 165 AppKit 2113.4)
:  of 2022-05-25

#+begin_src emacs-lisp :tangle no :exports both
  system-configuration-options
#+end_src

#+RESULTS:
: --enable-locallisppath=/usr/local/share/emacs/site-lisp --infodir=/usr/local/Cellar/emacs-mac/emacs-28.1-mac-9.0/share/info/emacs --prefix=/usr/local/Cellar/emacs-mac/emacs-28.1-mac-9.0 --with-mac --enable-mac-app=/usr/local/Cellar/emacs-mac/emacs-28.1-mac-9.0 --with-gnutls --with-modules --with-rsvg --with-mac-metal --with-native-compilation --with-xwidgets 'CFLAGS=-I/usr/local/opt/gcc/include -I/usr/local/opt/libgccjit/include' 'LDFLAGS=-L/usr/local/lib/gcc/11 -I/usr/local/opt/gcc/include -I/usr/local/opt/libgccjit/include'

